package days01;

/**
 * @author Bon
 * @date 2023. 12. 29. - 오후 3:15:45
 * @subject 상수에 대한 세부 설명
 * @content 상수의 명명 규칙 등
 */

public class Ex03_02 {
	
	public static void main(String[] args) {
		// 상수에 대한 설명
		/* 1. 저장공간, 초기화하면 변경X
	       * 수학관련 코딩
	       * 수학관련 코딩 * 3.141592
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 * 3.141592 코딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 코 * 3.143592딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학 * 3.141592관련 코딩
	       * 수학관련 코딩
	       * 수학관련 코 * 3.143292딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관 * 3.141592련 코딩
	       * */
		
		//PI 변수 선언 -> 상수화 시킨다 -> 상수
		// const 상수
		// java에서는 상수화 시킬때 변수명을 대문자로 사용하는 규칙이 있다
		final double PI;
		
		// 변수 firstName (합쳐진 단어는 첫번째 글짜만 대문자)
		// 상수 FIRST_NAME (합쳐진 단어는 이어지는 부분에 언더바_ 기입)
		
		// 상수에 대한 설명
		/* 1. 저장공간, 초기화하면 변경X
	       * 수학관련 코딩
	       * 수학관련 코딩 * 3.141592
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관련 * 3.141592 코딩
	       * 수학관련 코딩
	       * 수학관련 코딩
	       * 수학관 * 3.141592련 코딩
	       * */
		//  The [final local variable] pi cannot be assigned. 
		//	 It must be blank and not using a compound assignment
		//  pi = 3.14;
		//  final로 
		
				
	}

}
