package days03;

/**
 * @author BongGu
 * @date 2024. 1. 3. - 오후 1:59:20
 * @subject
 * @content
 */
public class Ex05 {

	public static void main(String[] args) {
		/*
		 * [연산자의 우선 순위]
		 * 1) 단항 연산자 (++ -- ! ~ (cast) )  ※ 연산 방향 ←
		 *    * 증감 연산자 포함
		 * 2) 산술 연산자
		 *    가. * / % (+ - 보다 더 높음)
		 *    나. + - 
		 *    
		 *    [비트] 쉬프트 연산자 >> <<
		 * 3) 비교 연산자 
		 *    가. > < >= <= instanceof
		 *    나. == !=
		 * 4) 논리 연산자
		 *    가. &
		 *    나. ^
		 *    다. |
		 *    라. &&
		 *    마. ||
		 * 5) 삼항 연산자 ※ 연산 방향 ←
		 *    - 항1 ? 항2 : 항3  
		 * 6) 대입 연산자 ※ 연산 방향 ←
		 *    - = += -= /= *= %= &= |= ^=
		 *    * 복합 대입 연산자도 포함
		 *    * n /= 2  n = 
		 *
		 */
		

	} //main

} //class
